Revit 2026 API
ItemFactoryBase.NewModelCurve Method
 Creates a new model line element.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public ModelCurve NewModelCurve(
	Curve geometryCurve,
	SketchPlane sketchPlane
)
Public Function NewModelCurve (
	geometryCurve As Curve,
	sketchPlane As SketchPlane
) As ModelCurve
public:
ModelCurve^ NewModelCurve(
	Curve^ geometryCurve,
	SketchPlane^ sketchPlane
)
member NewModelCurve :
        geometryCurve : Curve *
        sketchPlane : SketchPlane -> ModelCurve
Parameters
geometryCurve Curve
 The internal geometry curve for model line.
sketchPlane SketchPlane
The sketch plane this new model line resides in.
Return Value
ModelCurve
 If successful a new model line element. Otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown when curve is not in the plane
Remarks
 Different type of model curve element will be returned according to the type of geometry curve.
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace